AtoZ/app/Controllers/AdminController.php

INSERT INTO `package` (`package_name`, `package_details`, `package_amount`, `package_image`, `package_availability`) VALUES ('Package 1', 'Lumpia', '200.00', '287707634_393171242614934_4983530222573051779_n-removebg-preview.png', '')
---
    public function new_package()
    {
        $package_name = $this->request->getPost('package_name');
        $package_details = $this->request->getPost('package_details');
        $package_amount = $this->request->getPost('package_amount');
        $package_image = $this->request->getFile('package_image');
        $package_availability = $this->request->getPost('package_availability');

        $package_image->move(FCPATH . 'uploads');
        $pakage_data = [
            'package_name' => $package_name,
            'package_details' =>$package_details,
            'package_amount' => $package_amount,
            'package_image' => $package_image->getClientName(),
            'package_availability' => $package_availability

        ];

            $model = new PackageModel();
            $model->save($pakage_data);